* Question
:PROPERTIES:
:header-args:scheme: :eval no
:END:
Ben Bitdiddle has missed one meeting too many. Fearing that his habit of forgetting meetings could cost him his job, Ben decides to do something about it. He adds all the weekly meetings of the firm to the Microshaft data base by asserting the following:

#+begin_src scheme
  (meeting accounting (Monday 9am))
  (meeting administration (Monday 10am))
  (meeting computer (Wednesday 3pm))
  (meeting administration (Friday 1pm))
#+end_src

Each of the above assertions is for a meeting of an entire division. Ben also adds an entry for the company-wide meeting that spans all the divisions. All of the company's employees attend this meeting.

#+begin_src scheme
  (meeting whole-company (Wednesday 4pm))
#+end_src

a. On Friday morning, Ben wants to query the data base for all the meetings that occur that day. What query should he use?
b. Alyssa P. Hacker is unimpressed. She thinks it would be much more useful to be able to ask for her meetings by specifying her name. So she designs a rule that says that a person's meetings include all whole-company meetings plus all meetings of that person's division. Fill in the body of Alyssa's rule.

#+begin_src scheme
  (rule (meeting-time ?person ?day-and-time)
        <rule-body>)
#+end_src

c. Alyssa arrives at work on Wednesday morning and wonders what meetings she has to attend that day. Having defined the above rule, what query should she make to find this out?

* Answer
#+begin_src scheme :tangle 4.59.query.weekly-meetings.scm :eval no
  (define (install-weekly-meetings)
    (for-each mc-eval
              (list '(assert! (meeting accounting (Monday 9am)))
                    '(assert! (meeting administration (Monday 10am)))
                    '(assert! (meeting computer (Wednesday 3pm)))
                    '(assert! (meeting administration (Friday 1pm)))
                    '(assert! (meeting whole-company (Wednesday 4pm))))))
#+end_src
** a.
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.query.scm")
  (load "4.59.query.weekly-meetings.scm")
  (install-weekly-meetings)
  ;; Test
  (mc-eval '(meeting ?division (friday ?time)))
#+end_src

#+RESULTS:
:
: Assertion added to data base.
: Assertion added to data base.
: Assertion added to data base.
: Assertion added to data base.
: Assertion added to data base.
: ;;; Query results:
: (meeting administration (friday |1pm|))

** b.
#+begin_src scheme :tangle 4.59.query.my-meetings.scm :eval no
  (define (install-my-meetings)
    (mc-eval '(assert!
               (rule (my-meetings ?person ?day-and-time)
                     (or (and (job ?person (?division . ?job))
                              (meeting ?division ?day-and-time))
                         (meeting whole-company ?day-and-time))))))
#+end_src

** c.
#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.query.scm")
  (load "4.59.query.weekly-meetings.scm")
  (load "4.59.query.my-meetings.scm")
  (install-weekly-meetings)
  (install-my-meetings)
  ;; Test
  (mc-eval '(my-meetings (hacker alyssa p) (wednesday ?time)))
#+end_src

#+RESULTS:
#+begin_example

Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
Assertion added to data base.
;;; Query results:
(my-meetings (hacker alyssa p) (wednesday |3pm|))
(my-meetings (hacker alyssa p) (wednesday |4pm|))
#+end_example
